## TALLER BASE DEL ORO
## JUAN DAVID MORALES BAUTISTA

In [76]:
## Importando las librerías
import pandas as pd
import numpy as np

In [77]:
dataframeGold = pd.read_csv('gold_price_data.csv')
print(dataframeGold.columns)
dataframeGold.describe()

Index(['Date', 'Value'], dtype='object')

              Value
count  10787.000000
mean     653.596634
std      434.030848
min       35.100000
25%      349.200000
50%      409.350000
75%     1061.625000
max     1895.000000

In [78]:
print(dataframeGold.dtypes)
dataframeGold.head(10)

Date      object
Value    float64
dtype: object

         Date  Value
0  1970-01-01   35.2
1  1970-04-01   35.1
2  1970-07-01   35.4
3  1970-10-01   36.2
4  1971-01-01   37.4
5  1971-04-01   38.9
6  1971-07-01   40.1
7  1971-10-01   42.0
8  1972-01-03   43.5
9  1972-04-03   48.3

In [79]:
etiqueta = np.array(dataframeGold['Value'])[2:]
car_m1 = np.array(dataframeGold['Value'])[1:-1]
car_m2 = np.array(dataframeGold['Value'])[:-2]
print(len(etiqueta))
print(len(car_m1))
print(len(car_m2))

10785
10785
10785

In [80]:
## Agrupando los datos en un único Dataframe y exportándolo a un archivo CSV
dataset = pd.DataFrame({'Carac menos 2':car_m2, 'Carac menos 1':car_m1, 'Etiqueta':etiqueta})
dataset.to_csv('goldPriceArranged.csv')

In [81]:
## Pasando los datos a una matriz de tipo numpy
matrizDatos = dataset.to_numpy()

In [82]:
## Aqui se define la funcion de Costo ---------------------------------------------##
def funcioncosto(a1, a2):
     J=(a1-a2)**2
     return np.sum(J)/(2*len(J))

In [83]:
#### Aqui se realizan las busquedas de los valores de parámetros ---------------------
#Variables
J=0
T0=0
T1=0
x0=car_m1
x1=car_m2
## Modelo de Hipotesis dado
hx=T0*x1+T1*x1
min=funcioncosto(hx, etiqueta)
##Valores para hallar parámetros por fuerza bruta Grilla
for i in np.arange(0,1,0.01):
  for j in np.arange(0,1,0.01):
       hx2=i*x0+j*x1  ## Hipotesis para recorrer grilla
       J=funcioncosto(hx2,etiqueta)
       if J < min:
          min = J
          T0 = i ## Valores Minimos encontrados
          T1 = j
          min = J
print ("El parámetro Theta0 min es {} por otro lado le parámetro Theta1 min es {}".format(T0,T1))

El parámetro Theta0 min es 0.99 por otro lado le parámetro Theta1 min es 0.01